docs/test/jmeter/seckill-stress.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MallCloud Seckill Stress" enabled="true">
      <stringProp name="TestPlan.comments">秒杀压力脚本。用于 50/100/200/300/500 阶梯并发和 Sentinel 限流观察；不内置阈值结论。</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BaseURL" elementType="Argument">
            <stringProp name="Argument.name">BaseURL</stringProp>
            <stringProp name="Argument.value">${__P(BaseURL,http://localhost:9000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="usernamePrefix" elementType="Argument">
            <stringProp name="Argument.name">usernamePrefix</stringProp>
            <stringProp name="Argument.value">${__P(usernamePrefix,jmeter_seckill_)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="password" elementType="Argument">
            <stringProp name="Argument.name">password</stringProp>
            <stringProp name="Argument.value">${__P(password,123456)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="activityId" elementType="Argument">
            <stringProp name="Argument.name">activityId</stringProp>
            <stringProp name="Argument.value">${__P(activityId,9001)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="skuId" elementType="Argument">
            <stringProp name="Argument.name">skuId</stringProp>
            <stringProp name="Argument.value">${__P(skuId,9003)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Seckill Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(users,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,1)}</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/auth/login" enabled="true">
          <stringProp name="HTTPSampler.protocol">${__groovy(new URL(vars.get('BaseURL')).protocol)}</stringProp>
          <stringProp name="HTTPSampler.domain">${__groovy(new URL(vars.get('BaseURL')).host)}</stringProp>
          <stringProp name="HTTPSampler.port">${__groovy(new URL(vars.get('BaseURL')).port == -1 ? '' : new URL(vars.get('BaseURL')).port)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username":"${usernamePrefix}${__threadNum}","password":"${password}","loginType":"PASSWORD"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.accessToken</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract token regex fallback" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">token</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;accessToken&quot;\s*:\s*&quot;([^&quot;]+)&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">TOKEN_NOT_FOUND</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Login code 200 and token extracted" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def body = prev.getResponseDataAsString()
def token = vars.get('token')
if (prev.getResponseCode() != '200' || !(body.contains('&quot;code&quot;:200') || body.contains('&quot;code&quot;: 200')) || token == null || token == 'TOKEN_NOT_FOUND') {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Login failed or token not extracted: HTTP ' + prev.getResponseCode())
    prev.setSampleLabel('其他非预期失败')
} else {
    prev.setSampleLabel('登录成功')
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
            </elementProp>
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${token}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/seckill/{activityId}" enabled="true">
          <stringProp name="HTTPSampler.protocol">${__groovy(new URL(vars.get('BaseURL')).protocol)}</stringProp>
          <stringProp name="HTTPSampler.domain">${__groovy(new URL(vars.get('BaseURL')).host)}</stringProp>
          <stringProp name="HTTPSampler.port">${__groovy(new URL(vars.get('BaseURL')).port == -1 ? '' : new URL(vars.get('BaseURL')).port)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/seckill/${activityId}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"skuId":${skuId},"quantity":1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract requestId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">requestId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.requestId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">REQUEST_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Init result polling variables" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">vars.put('resultDone', 'false')
vars.put('resultAttempts', '0')
vars.put('finalSeckillStatus', '')
vars.put('finalOrderNo', '')</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Seckill response is expected" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def body = prev.getResponseDataAsString()
def status = prev.getResponseCode() as int
if (status &gt;= 500) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('HTTP 5xx')
    prev.setSampleLabel('HTTP 5xx')
    return
}
if (status == 429 &amp;&amp; body.contains('Blocked by Sentinel')) {
    prev.setSuccessful(true)
    prev.setSampleLabel('Sentinel 429')
    return
}
if (status != 200) {
    AssertionResult.setFailure(true)
    prev.setSampleLabel('其他非预期失败')
    return
}
if (body.contains('&quot;code&quot;:200') || body.contains('&quot;code&quot;: 200')) {
    prev.setSampleLabel('秒杀请求成功受理')
} else if (body.contains('&quot;code&quot;:40400') || body.contains('&quot;code&quot;: 40400')) {
    prev.setSampleLabel('库存不足')
} else if (body.contains('&quot;code&quot;:40403') || body.contains('&quot;code&quot;: 40403')) {
    prev.setSampleLabel('用户限购')
} else {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Unexpected seckill response: ' + body)
    prev.setSampleLabel('其他非预期失败')
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Poll result when requestId exists" enabled="true">
          <stringProp name="IfController.condition">${__groovy(vars.get('requestId') != 'REQUEST_NOT_FOUND')}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Poll result up to limit" enabled="true">
            <boolProp name="LoopController.continue_forever">false</boolProp>
            <stringProp name="LoopController.loops">${__P(resultPollAttempts,20)}</stringProp>
          </LoopController>
          <hashTree>
            <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Poll while result pending" enabled="true">
              <stringProp name="IfController.condition">${__groovy(vars.get('resultDone') != 'true')}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
              <boolProp name="IfController.useExpression">true</boolProp>
            </IfController>
            <hashTree>
              <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Poll delay" enabled="true">
                <stringProp name="ConstantTimer.delay">${__P(resultPollDelayMs,500)}</stringProp>
              </ConstantTimer>
              <hashTree/>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/seckill/result/{requestId}" enabled="true">
                <stringProp name="HTTPSampler.protocol">${__groovy(new URL(vars.get('BaseURL')).protocol)}</stringProp>
                <stringProp name="HTTPSampler.domain">${__groovy(new URL(vars.get('BaseURL')).host)}</stringProp>
                <stringProp name="HTTPSampler.port">${__groovy(new URL(vars.get('BaseURL')).port == -1 ? '' : new URL(vars.get('BaseURL')).port)}</stringProp>
                <stringProp name="HTTPSampler.path">/api/v1/seckill/result/${requestId}</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract result fields" enabled="true">
                  <stringProp name="JSONPostProcessor.referenceNames">resultStatus;resultOrderNo</stringProp>
                  <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.status;$.data.orderNo</stringProp>
                  <stringProp name="JSONPostProcessor.match_numbers">1;1</stringProp>
                  <stringProp name="JSONPostProcessor.defaultValues">RESULT_STATUS_NOT_FOUND;RESULT_ORDER_NOT_FOUND</stringProp>
                </JSONPostProcessor>
                <hashTree/>
                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Track final result" enabled="true">
                  <stringProp name="cacheKey">true</stringProp>
                  <stringProp name="script">def attempts = (vars.get('resultAttempts') ?: '0') as int
vars.put('resultAttempts', String.valueOf(attempts + 1))
def body = prev.getResponseDataAsString()
def parsed = new groovy.json.JsonSlurper().parseText(body)
def status = parsed?.data?.status == null ? '' : String.valueOf(parsed.data.status)
def orderNo = parsed?.data?.orderNo == null ? '' : String.valueOf(parsed.data.orderNo)
vars.put('resultStatus', status)
vars.put('resultOrderNo', orderNo)
if (status == '1' || status == '2') {
    vars.put('resultDone', 'true')
    vars.put('finalSeckillStatus', status)
    vars.put('finalOrderNo', orderNo)
}</stringProp>
                  <stringProp name="scriptLanguage">groovy</stringProp>
                </JSR223PostProcessor>
                <hashTree/>
                <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Result response is valid" enabled="true">
                  <stringProp name="cacheKey">true</stringProp>
                  <stringProp name="script">def body = prev.getResponseDataAsString()
def status = prev.getResponseCode() as int
if (status &gt;= 500) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('HTTP 5xx')
    prev.setSampleLabel('HTTP 5xx')
    return
}
if (status != 200 || !(body.contains('&quot;code&quot;:200') || body.contains('&quot;code&quot;: 200'))) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Unexpected result response: HTTP ' + prev.getResponseCode())
    prev.setSampleLabel('其他非预期失败')
}</stringProp>
                  <stringProp name="scriptLanguage">groovy</stringProp>
                </JSR223Assertion>
                <hashTree/>
              </hashTree>
            </hashTree>
          </hashTree>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Validate final seckill result" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def status = vars.get('finalSeckillStatus')
def orderNo = vars.get('finalOrderNo')
SampleResult.setDataType(org.apache.jmeter.samplers.SampleResult.TEXT)

if (status == '1' &amp;&amp; orderNo != null &amp;&amp; orderNo.trim().length() &gt; 0 &amp;&amp; orderNo != 'RESULT_ORDER_NOT_FOUND') {
    SampleResult.setResponseCode('200')
    SampleResult.setResponseMessage('OK')
    SampleResult.setResponseData('final seckill result validated', 'UTF-8')
    SampleResult.setSuccessful(true)
    SampleResult.setSampleLabel('最终订单成功')
} else if (status == '2') {
    SampleResult.setResponseCode('500')
    SampleResult.setResponseMessage('Business Failed')
    SampleResult.setResponseData(('status=' + status + ', orderNo=' + orderNo), 'UTF-8')
    SampleResult.setSuccessful(false)
    SampleResult.setSampleLabel('最终业务失败')
} else {
    SampleResult.setResponseCode('500')
    SampleResult.setResponseMessage('Timeout or Unconfirmed')
    SampleResult.setResponseData(('attempts=' + vars.get('resultAttempts')), 'UTF-8')
    SampleResult.setSuccessful(false)
    SampleResult.setSampleLabel('结果轮询超时')
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Sampler>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>